from numpy import array

l1 = 40
l2 = 10
x0_x1 = 3
s_ld = 360
cos_ld = 0.85
u_ld = 220

# g1: с. 6 из приложения по программам
p_g = array([100, 63])
cos_g = array([0.8, 63])

# ТВФ-100-2
g1 = {'type': 'ТВФ-100-2', 'p': 100, 'cos': 0.8, 'q': 75, 'u': 10.5, 'x_d__': 0.191, 'x_d_': 0.278, 'x_d': 1.92, 'x_sig': 16.7,
      'x2': 23.4, 'x0': 9.73, 'окз': 0.563, 'gd': 13, 't_d0': 6.5, 'n': 3000}
# g2: св-655/110-32 с. 84 Неклепаев
# g2: СВ-850/120-60
g2 = {'s': 40,'p': 32, 'cos': 0.8, 'u': 10.5, 'x_d__': 0.225, 'x_d_': 0.309, 'x_d': 0.81, 'x_q': 0.58, 'n': 100,
      'x2': 0.23, 'type': 'СВ-850/120-60', 't_d0': 4.5}
# Т1: ТДЦ-200000/220 с. 156 Неклепаев
t1 = {'s': 200, 'u_hv': 242, 'u_lv': 13.8, 'p0': 130, 'p_sc': 660, 'cos': 0.8, 'u_sc': 11}
# Т2: ТДТН-63000/220 с. 156, 159 Неклепаев
# 'i0':
t2 = {'s': 63, 'u_hv': 230, 'u_mv': 38.5, 'u_lv': 11,'u_sc_h-m': 11,
      'u_sc_h-l': 12.5, 'u_sc_m-l': 9.5, 'p0': 130, 'p_sc': 68/50, 'cos': 0.8}

x_ln = 0.42
r_ln = 0.073
n_g1 = 3
n_t1 = 2
# g2['s'] = sqrt(g2[''])


