from numpy import array

l1 = 40
l2 = 10
x0_x1 = 3
s_ld = 360
cos_ld = 0.85
u_ld = 220

# g1: c. 6 из приложения по программам
p_g = array([100, 63])
cos_g = array([0.8, 63])


g1 = {'p': 100, 'cos': 0.8, 'q': 75, 'u': 10.5, 'x_d__': 19.1, 'x_d_': 27.8, 'x_d': 192, 'x_sig': 16.7,
      'x2': 23.4, 'x0': 9.73, 'окз': 0.563, 'gd2': 13, 't_d0': 6.5, 'n': 3000}  # ТВФ-100-2
# g2: св-655/110-32 с. 84 Неклепаев
g2 = {'p': 63, 'cos': 0.85, 'q': 39.4, 'u': 10.5, 'x_d__': 19.1, 'x_d_': 27.8, 'x_d': 192, 'x_sig': 16.7,
      'x2': 23.4, 'x0': 9.73, 'окз': 0.563, 'gd2': 13, 't_d0': 6.5}  # ТВФ-100-2
# Т1: ТДЦ-200000/220 с. 156 Неклепаев
t1 = {'s': 200, 'u_hv': 242, 'u_lv': 13.8, 'p0': 130, 'p_sc': 660, 'cos': 0.8, 'u_sc': 11}
# Т2: ТДТН-63000/220 с. 156, 159 Неклепаев
# 'i0': ,
t2 = {'s': 63, 'u_hv': 230, 'u_mv': 38.5, 'u_lv': 11,'u_sc_h-m': 11,
      'u_sc_h-l': 12.5, 'u_sc_m-l': 9.5, 'p0': 130, 'p_sc': 68/50, 'cos': 0.8}

x_ln = 0.42
r_ln = 0.073
# g2['s'] = sqrt(g2[''])


